24001/1063_rq.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:jour="http://journal.ws.spectrum" xmlns:xsd="http://model.ws.spectrum/xsd">
   <soap:Header/>
   <soap:Body>
      <jour:create>
         <jour:request>
            <xsd:operationEntity>
               <xsd:client>
                  <xsd:clientTypeEnum>0</xsd:clientTypeEnum>
                  <xsd:clientExtId>5555-90-siebel</xsd:clientExtId>
                  <xsd:clientIdSys>SBL_FR</xsd:clientIdSys>
                  <xsd:icIssueAutority>[icIssueAutority]</xsd:icIssueAutority>
                  <xsd:icIssueDate>2005-09-06</xsd:icIssueDate>
                  <xsd:icNum>[client.icNum]</xsd:icNum>
                  <xsd:icSeries>[client.icSeries]</xsd:icSeries>
                  <xsd:identityCardTypeId>21</xsd:identityCardTypeId>
                  <xsd:personFirstName>[personFirstName]</xsd:personFirstName>
                  <xsd:personPatronymic>[personPatronymic]</xsd:personPatronymic>
                  <xsd:personSurname>[personSurname]</xsd:personSurname>
                  <xsd:personCitizenCountryCode>643</xsd:personCitizenCountryCode>
               </xsd:client>
               <xsd:deptCode>1126</xsd:deptCode>
               <!--<xsd:extFee>
                  <xsd:currency>RUB</xsd:currency>
                  <xsd:summa>88</xsd:summa>
               </xsd:extFee>-->
               <xsd:documents>
                  <xsd:analyticAttributes>
                     <xsd:code>CBO_CODE</xsd:code>
                     <xsd:value>711210-00</xsd:value>
                  </xsd:analyticAttributes>
                  <xsd:creditSumma>
                     <xsd:currency>USD</xsd:currency>
                     <xsd:summa>1500</xsd:summa>
                  </xsd:creditSumma>
                  <xsd:creditAccountEntity>
                     <xsd:accountIdSys>99995</xsd:accountIdSys>
                     <xsd:accountNum>40817840700020071063</xsd:accountNum>
                     <xsd:deptCode>1126</xsd:deptCode>
                  </xsd:creditAccountEntity>
                  <xsd:debitSumma>
                     <xsd:currency>USD</xsd:currency>
                     <xsd:summa>1500</xsd:summa>
                  </xsd:debitSumma>
                  <xsd:description>Внесение наличных на банковский счет 
                  На основании: договор No [accountNum]</xsd:description>
                  <xsd:docNumber>003</xsd:docNumber>
               </xsd:documents>
               <xsd:login>O1126</xsd:login>
               <xsd:idSys>99995</xsd:idSys>
               <xsd:operJournalExtId>SP.CONP.10630003</xsd:operJournalExtId>
               <xsd:operationCode>1063</xsd:operationCode>
               <!--<xsd:operationRegDate>2022-02-22T10:00:00</xsd:operationRegDate>-->
               <!--<xsd:contentItems>
                  <xsd:extId>09bbdc0b-c9bf-4205-a81f-c8ddffb1cf38</xsd:extId>
                  <xsd:name>Документ-основание</xsd:name>
             </xsd:contentItems>
               <xsd:proxyClient>
                  <xsd:clientTypeEnum>0</xsd:clientTypeEnum>
                  <xsd:icIssueAutority>[icIssueAutority]</xsd:icIssueAutority>
                  <xsd:icIssueDate>2022-01-01</xsd:icIssueDate>
                  <xsd:icNum>[ProxyClient:icNum]</xsd:icNum>
                  <xsd:icSeries>[ProxyClient:icSeries]</xsd:icSeries>
                  <xsd:identityCardTypeId>21</xsd:identityCardTypeId>
                  <xsd:personFirstName>[proxyClient:personFirstName]</xsd:personFirstName>
                  <xsd:personPatronymic>[proxyClient:personPatronymic]</xsd:personPatronymic>
                  <xsd:personSurname>[proxyClient:personSurname]</xsd:personSurname>
                  <xsd:personStatelessFlag>0</xsd:personStatelessFlag>
                  <xsd:personCitizenCountryCode>643</xsd:personCitizenCountryCode>
               </xsd:proxyClient>-->
            </xsd:operationEntity>
            <xsd:requestInfo>
               <xsd:messageId/>
            </xsd:requestInfo>
         </jour:request>
      </jour:create>
   </soap:Body>
</soap:Envelope>